#include <iostream>
using namespace std;

int main()
{

    /*
    
    逻辑条件

    与  &&    1 && 1 = 1  1 && 0 = 0  0 && 1 = 0  0 && 0 = 0
    或  ||    1 || 1 = 1  1 || 0 = 1  0 || 1 = 1  0 || 0 = 0
    非  !     !1 = 0   !0 = 1
    
    */

    //

    int a = 3;

    //  a > 1 为 真 为 1   a > 2 为 真 为 1
    cout << "&&" << endl;             // (  &&   )
    cout << (a > 1 && a > 2) << endl; // (  1 && 1   ) 1
    //  a < 1 为 假 为 0   a > 2 为 真 为 1
    cout << (a < 1 && a > 2) << endl; // (  0 && 1   ) 0
    //  a > 1 为 假 为 0   a < 2 为 假 为 0
    cout << (a < 1 && a < 2) << endl; // (  0 && 0   ) 0
    //  a > 1 为 真 为 1   a < 2 为 真 为 1
    cout << (a > 1 && a < 2) << endl; // (  1 && 0   ) 0

    cout << "||" << endl; // (  ||   )
    //  a > 1 为 真 为 1   a > 2 为 真 为 1
    cout << (a > 1 || a > 2) << endl; // (  1 || 1   ) 1
    //  a < 1 为 假 为 0   a > 2 为 真 为 1
    cout << (a < 1 || a > 2) << endl; // (  0 || 1   ) 1
    //  a > 1 为 假 为 0   a < 2 为 假 为 0
    cout << (a < 1 || a < 2) << endl; // (  0 || 0   ) 0
    //  a > 1 为 真 为 1   a < 2 为 真 为 1
    cout << (a > 1 || a < 2) << endl; // (  1 || 0   ) 1

    cout << "!" << endl; // (  !  )

    cout << !(a > 1) << endl; // (  !1   ) 0
    //  a < 1 为 假 为 0
    cout << !(a < 1) << endl; // (  !0  ) 1
}